Autodesk.Revit.DB.IFC.IFCGuidKey.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.IFC.IFCGuidKey.IFCGlobalId
IFC GlobalId for map.
Since:
2024

Autodesk.Revit.DB.IFC.IFCGuidKey.GetHashCode
Returns the hash code for this IFCGuidKey
Returns:
A 32-bit signed integer hash code.
Since:
2024

Autodesk.Revit.DB.IFC.IFCGuidKey.Equals(System.Object)
Determines whether this IFCGuidKey is equal to another.
other:
The IFCGuidKey with which to compare this IFCGuidKey.
Returns:
True if the given IFCGuidKey is equal to this one, or false otherwise.
Since:
2024

Autodesk.Revit.DB.IFC.IFCGuidKey.#ctor(System.String)
Constructs a new IFCHybridGuid
ifcGuid:
IFC Global ID
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2024

Autodesk.Revit.DB.IFC.IFCGuidKey.#ctor(Autodesk.Revit.DB.IFC.IFCGuidKey)
IFCGuidKey can be used in managed code as well as unmanaged.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2024

Autodesk.Revit.DB.IFC.IFCGuidKey
IFCGuidKey is used for case-sensitive comparison of GUID values for maps and sets.
Since:
2024